МояРазработка.Аратюнов/src/InformationRegisters/УО_ХранилищеСхем/УО_ХранилищеСхем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УО_ХранилищеСхем</name>
  <resources>
    <name>Схема</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>РегистрацияСхемы</name>
    <type>
      <types>CatalogRef.УО_РегистрацияСхемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МояРазработка.Аратюнов/src/InformationRegisters/УО_ХранилищеСхем/Forms/ОбработчикСохраненияСхемы/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ЗаписатьДанные(Параметры.РегистрацияСхемы, ВыбранноеЗначение);
	Оповестить("ЗагруженаСхема", Параметры.РегистрацияСхемы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДанные(Знач РегистрацияСхемы, Знач Схема)
	
	РегистрыСведений.УО_ХранилищеСхем.ДобавитьСхему(РегистрацияСхемы,, Схема);

КонецПроцедуры

#КонецОбласти
